# 4. * Функция принимает в качестве аргументов строки в формате «Имя Фамилия»,
# возвращает словарь, ключи — первые буквы фамилий, значения — словари,
# реализованные по схеме предыдущего задания.
# in
# "Иван Сергеев", "Инна Серова", "Петр Алексеев",
# "Илья Иванов", "Анна Савельева", "Юнона Ветрякова",
# "Борис Аркадьев", "Антон Серов", "Павел Анисимов"
# out

# {'С': {'А': ['Анна Савельева', 'Антон Серов'], 'И': ['Иван Сергеев', 'Инна Серова']},
# 'А': {'Б': ['Борис Аркадьев'], 'П': ['Павел Анисимов', 'Петр Алексеев']},
# 'И': {'И': ['Илья Иванов']}, 'В': {'Ю': ['Юнона Ветрякова']}}


def get_dict(names: str):
    names = [n.split() for n in names]
    m_dict = {}.fromkeys([n[1][:1] for n in names], [])
    for k, v in m_dict.items():
        v = {}.fromkeys([n[0][:1] for n in names if n[1][:1] == k], [])
        for k2,v2 in v.items():
            v.update({k2:[' '.join(n) for n in names if n[1][:1] == k and n[0][:1] == k2]})
        m_dict.update({k: v})
    return m_dict


names = ["Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов",
         "Анна Савельева", "Юнона Ветрякова", "Борис Аркадьев", "Антон Серов", "Павел Анисимов"]
print(get_dict(names))
